app/controllers/api/v1/ideas_controller.rb

  def index
    render json: Idea.all
---
SELECT "ideas".* FROM "ideas"

  def create
    render json: Idea.create(idea_params)
---
INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["body", "123"], ["created_at", 2016-10-05 22:02:38 UTC], ["updated_at", 2016-10-05 22:02:38 UTC]]

  def destroy
    render json: Idea.destroy(params[:id])
---
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 5]]

  def update
    idea = Idea.find(idea_params[:id])
    render json: idea.update(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "ideas" SET "title" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["title", "bob"], ["updated_at", 2016-10-06 12:54:57 UTC], ["id", 19]]