app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all.order(created_at: :desc)
---
SELECT "ideas".* FROM "ideas" ORDER BY "ideas"."created_at" DESC